<?php
/*© A.A.CheckMaRev assminog@gmail.com*/
//////		 ////	//	   //	 //    // /////   /////  ///// /////  //   // /////  //    //  ////
   //   /\ RCe	//	//	//    // //    // //   // //  // //    //  // //   // //  // //    // //
  //  <  **> 	//	//	//    // //    // //   // // //  ///   /////  //   // ////   //    // //
 //     Jl   	//	//	//    // //    // //   // //  // //    //     //   // //  // //    // //
//////		 /////	//////	   //	   ////   /////   //  // ///// //       ///   /////  ///// //  /////
//setcookie('strListener', $this->сМойНомерок, time()+(60*60*24*365), '/', 'HiFiInteligentClub.'.strGetDomainZone(), false, false);!!! NO COOCKIES IS SUXX!!
//1.Разбираем сеанс
//1.1.Проверяем есть ли он
//1.1.1.ЕСТЬ
//1.1.1.1.Читаем предидущмй сеанс.
//1.1.2.НЕТ
//1.1.2.1.Записываем новый сеанс.
//1.2.З.аписываем в историю текущий сеанс.

//1                       
//1                    |Я|
//1///////////// //////| |////////
//1//         // //    | |      //---------------->
//1//         // //    | |      //
//1____________________|Я|________________________________________________________________________
//2                    | |////////Сервер 1) Сессия/Пустая сессия
//2                    | |EDRO  //---------------->
//2                    | |      //
//2		       | ---------------->
//2                    | ---------------->
//2                    | ---------------->
//2                    '---------------->
class СоздатьСеанс
	{
	public	$сПредидущаяПозиция		= '';
	private	$сРасполож			= '/home/EDRO.o2o';
	private	$сРоль				= 'Listener';
	private $сОконч				= '.O20';
	private	$ч0ВсегоСлушателей		= 0;
	private $сМояПозицияО2О			= '';
	private	$сТекущийСеанс			= '';
	private	$сМойНомерок			= '';
	public function __construct($_сРоль, $_м=array())
		{
		$this->сРоль		=$_сРоль;
			           unset($_сРоль);
		$м['сЖанр']		=$_м['strStyle'];
				   unset($_м);
		$this->сМояПозицияО2О		='_'.floor(microtime(true));
		$this->сМойНомерок		=$_SERVER['strListener'];
		$this->сТекущийСеанс		=$this->сМойНомерок.'_'.$this->сМояПозицияО2О.$this->сОконч;
		if($this->сМойНомерок!='')
			{
			$this->_ПолучитьАвторизацию();
			}
		else
			{
			$this->_НоваяАвторизация();
			}

		$this->_ЗаписатьРоль();
		$this->_ЗаписатьСлушателя();
		$this->_ЗаписатьИсторию($м);

		}
	private function _ПолучитьАвторизацию()
		{
		if(is_file($this->сРасполож.'/'.$this->сРоль.'/'.$this->сМойНомерок.'/0'.$this->сОконч))
			{
			//_Report('$this->сМойНомерок!=_'.$this->сМойНомерок);
			$this->сПредидущаяПозиция	=file_get_contents($this->сРасполож.'/'.$this->сРоль.'/'.$this->сМойНомерок.'/0'.$this->сОконч);
			}
		}
	private function _НоваяАвторизация()
		{
		$оВсего		=FileRead::objО2О($objKIIM, $this->сРасполож.'/'.$this->сРоль.'Total'.$this->сОконч);
		if(isset($оВсего->int0Total))
			{
			$this->ч0ВсегоСлушателей	=($оВсего->int0Total);
			}
		$this->ч0ВсегоСлушателей++;
		$оO2oЗаписьИтого	=new O2oЗаписьИтого($objKIIM, $this->сРоль, array(
							'int0Total'		=>$this->ч0ВсегоСлушателей,
							'int0'.$this->сРоль	=>$this->ч0ВсегоСлушателей
							)
						);
		$this->сМойНомерок		=сКодировать($this->ч0ВсегоСлушателей, 'к');
		//	$_SESSION['strListener']	= $this->сМойНомерок;
		}
	private function _ЗаписатьРоль()
		{
		if(!is_dir($this->сРасполож.'/'.$this->сРоль))
			{
			if(mkdir($this->сРасполож.'/'.$this->сРоль)===FALSE)
				{
				_Report('Не создать расположение: '.$this->сРасполож.'/'.$this->сРоль);
				}
			}
		}
	private function _ЗаписатьСлушателя()
		{
		if(is_dir($this->сРасполож.'/'.$this->сРоль.'/'.$this->сМойНомерок))
			{
			}
		else
			{
			if(mkdir($this->сРасполож.'/'.$this->сРоль.'/'.$this->сМойНомерок)===FALSE)
				{
				_Report('Cant create dir: '.$this->сРасполож.'/'.$this->сРоль.'/'.$this->сМойНомерок);
				}
			}
		}
	private function _ЗаписатьИсторию($м)
		{
		if(file_put_contents($this->сРасполож.'/History/'.$this->сРоль.'/'.$this->сТекущийСеанс, strMyJson($м)))
			{
			_Report('Не записать историю: '.$this->сРасполож.'/History/'.$this->сРоль.'/'.$this->сМойНомерок.$this->сОконч);
			}
		}
	public static function с($_сРоль, $_м=array())
		{
		$obj	=new СоздатьСеанс($_сРоль, $_м);
		return $obj->сМойНомерок;
		}
	}
?>