<?php
/* © A.A.CheckMaRev assminog@gmail.com*/
//////		 ....	..	   ..	 ..    .. .....   /////  ///// /////  //   // /////  //    //  ////
   //   /\ RCe	..	..	..    .. ..    .. ..   .. //  // //    //  // //   // //  // //    // //
  //  <  **> 	..	..	..    .. ..    .. ..   .. // //  ///   /////  //   // ////   //    // //
 //     Jl   	..	..	..    .. ..    .. ..   .. //  // //    //     //   // //  // //    // //
//////		 .....	......	   ..	   ....   .....   //  // ///// //       ///   /////  ///// //  /////
//setcookie('strListener', $this->сМойНомерок, time()+(60*60*24*365), '/', 'HiFiInteligentClub.'.strGetDomainZone(), false, false);
//1.Разбираем сеанс
//1.1.Проверяем есть ли он
//1.1.1.ЕСТЬ
//1.1.1.1.Читаем предидущмй сеанс.
//1.1.2.НЕТ
//1.1.2.1.Записываем новый сеанс.
//1.2.З.аписываем в историю текущий сеанс.

//1                       
//1                    |Я|
//1///////////// //////| |////////
//1//         // //    | |      //---------------->
//1//         // //    | |      //
//1____________________|Я|________________________________________________________________________
//2                    | |////////Сервер 1) Сессия/Пустая сессия
//2                    | |EDRO  //---------------->
//2                    | |      //
//2		       | ---------------->
//2                    | ---------------->
//2                    | ---------------->
//2                    '---------------->
class СоздатьСеанс
	{
	public	$сПредидущаяПозиция		= '';
	private	$сРасполож			= '/home/EDRO.o2o';
	private	$сРоль				= 'Listener';
	private $сОконч				= '.О20';
	private $сОНастройкиСлушателя		= '';
	private	$ч0ВсегоСлушателей		= 0;
	private $сМояПозицияО2О			= '';
	private	$сТекущийСеанс			= '';
	private	$сМойНомерок			= '';
	private $сЖанр				= '';
	private $objEDRO			= array();
	public function __construct($_сРоль, $objEDRO)
		{
		$this->сРоль			= $_сРоль;
					    unset($_сРоль);
		$this->$objEDRO			= $objEDRO;
		$this->сМояПозицияО2О		= '_'.floor(microtime(true));
		$this->сОНастройкиСлушателя	= '0'.$this->сОконч;
		$this->сРасположИтого		= $this->сРасполож.'/'.$this->сРоль.'Total'.$this->сОконч;
		$this->сМойНомерок		= $this->$objEDRO->arrEvent['arrListener']['Cookie'];
		//print_r($objEDRO);


		//$this->сЖанр			= $strGenre;
		//$this->сМойНомерок		= $_SERVER['strListener'];

		if($this->сМойНомерок=='')
			{
			$this->сМойНомерок	= $this->сПолучитьНастройкиСлушателя();
			}
		else
			{
			$this->сМойНомерок	= $this->сЗаписатьНастройкиСлушателя();
			}

		echo $this->сТекущийСеанс		= $this->сМойНомерок.'_'.$this->сМояПозицияО2О.$this->сОконч;
		echo "\n";echo "\n";echo "\n";echo "\n";echo "\n";echo "\n";echo "\n";echo "\n";
		$this->_ЗаписатьРоль();
		$this->_ЗаписатьСлушателя();
		$this->_ЗаписатьИсторию($_м);
		}













	private function сЗаписатьНастройкиСлушателя()
		{
		//echo 'сНоваяАвторизация()'."\n";
					$this->_ЗаписатьРоль();
		$oCountWoW		= FileRead::objО2О($this->сРасположИтого);
		if(isset($oCountWoW->int0Total))
			{
			$ч0ВсегоСлушателей	= $oCountWoW->int0Total;
			}
		else
			{
			_Report(__CLASS__.' '.__FUNCTION__.' $ч0ВсегоСлушателей: '.$ч0ВсегоСлушателей);
			}
		$ч0ВсегоСлушателей++;
		$оO2oЗаписьИтого	= new O2oЗаписьИтого($this->сРоль, array(
							'int0Total'		=>$ч0ВсегоСлушателей,
							'int0'.$this->сРоль	=>$ч0ВсегоСлушателей
							)
						);
		return $ч0ВсегоСлушателей;
		}







	private function сПолучитьНастройкиСлушателя()
		{
		//echo 'сПолучитьАвторизацию()'."\n";
		$сЗаписаннаяПозиция		= '';
		$сРасположОНастройки		= $this->сРасполож.'/'.$this->сРоль.'/'.$this->сМойНомерок.'/'.$this->сОНастройкиСлушателя;
		if(is_file($сРасположОНастройки))
			{
			$сЗаписаннаяПозиция = file_get_contents($сРасположОНастройки);
			}
		if($сЗаписаннаяПозиция=='')
			{
			_Report(__CLASS__.' '.__FUNCTION__.' $сЗаписаннаяПозиция: '.$сЗаписаннаяПозиция);
			}
		return $сЗаписаннаяПозиция;
		}




	private function _ЗаписатьРоль()
		{
		if(!is_dir($this->сРасполож.'/'.$this->сРоль))
			{
			if(mkdir($this->сРасполож.'/'.$this->сРоль)===FALSE)
				{
				_Report('Не создать расположение: '.$this->сРасполож.'/'.$this->сРоль);
				}
			}
		}
	private function _ЗаписатьСлушателя()
		{
		if(is_dir($this->сРасполож.'/'.$this->сРоль.'/'.$this->сМойНомерок))
			{
			}
		else
			{
			if(mkdir($this->сРасполож.'/'.$this->сРоль.'/'.$this->сМойНомерок)===FALSE)
				{
				_Report('Cant create dir: '.$this->сРасполож.'/'.$this->сРоль.'/'.$this->сМойНомерок);
				}
			else
				{
				if(file_put_contents($this->сРасполож.'/'.$this->сРоль.'/'.$this->сТекущийСеанс, strMyJson($м)))
					{
					_Report('Не записать историю: '.$this->сРасполож.'/'.$this->сРоль.'/'.$this->сМойНомерок.$this->сОконч);
					}
				}
			}
		}
	private function _ЗаписатьИсторию($м)
		{

		}
	public static function с($_сРоль, $objEDRO)
		{
		$obj	= new СоздатьСеанс($_сРоль, $objEDRO);
		return $obj->сМойНомерок;
		}
	}
?>