<?php
/* © A.A.CheckMaRev assminog@gmail.com*/
//////		 ////	//	   //	 //    // /////   /////  ///// /////  //   // /////  //    //  ////
   //   /\ RCe	//	//	//    // //    // //   // //  // //    //  // //   // //  // //    // //
  //  <  **> 	//	//	//    // //    // //   // // //  ///   /////  //   // ////   //    // //
 //     Jl   	//	//	//    // //    // //   // //  // //    //     //   // //  // //    // //
//////		 /////	//////	   //	   ////   /////   //  // ///// //       ///   /////  ///// //  /////
//setcookie('strListener', $this->сМойНомерок, time()+(60*60*24*365), '/', 'HiFiInteligentClub.'.strGetDomainZone(), false, false);
//1.Разбираем сеанс
//1.1.Проверяем есть ли он
//1.1.1.ЕСТЬ
//1.1.1.1.Читаем предидущмй сеанс.
//1.1.2.НЕТ
//1.1.2.1.Записываем новый сеанс.
//1.2.З.аписываем в историю текущий сеанс.

//1                       
//1                    |Я|
//1///////////// //////| |////////
//1//         // //    | |      //---------------->
//1//         // //    | |      //
//1____________________|Я|________________________________________________________________________
//2                    | |////////Сервер 1) Сессия/Пустая сессия
//2                    | |EDRO  //---------------->
//2                    | |      //
//2		       | ---------------->
//2                    | ---------------->
//2                    | ---------------->
//2                    '---------------->
class СоздатьСеанс
	{
	public	$сПредидущаяПозиция		= '';
	private	$сРасполож			= '/home/EDRO.o2o';
	private	$сРоль				= 'Listener';
	private $сОконч				= '.О20';
	private	$ч0ВсегоСлушателей		= 0;
	private $сМояПозицияО2О			= '';
	private	$сТекущийСеанс			= '';
	private	$сМойНомерок			= '';
	private $сЖанр				= '';
	public function __construct($_сРоль, $_м)
		{
		$this->сРоль		=$_сРоль;
			           unset($_сРоль);
		//$this->сЖанр		=$strGenre;
		
		echo $this->сМояПозицияО2О		='_'.floor(microtime(true));
		echo "\n";
		//$this->сМойНомерок		=$_SERVER['strListener'];

		if($this->сМойНомерок!='')
			{
			$this->сМойНомерок	=$this->сПолучитьАвторизацию();
			}
		else
			{
			$this->сМойНомерок	=$this->сНоваяАвторизация();
			}
		echo $this->сТекущийСеанс		=$this->сМойНомерок.'_'.$this->сМояПозицияО2О.$this->сОконч;
		echo "\n";
		$this->_ЗаписатьРоль();
		$this->_ЗаписатьСлушателя();
		$this->_ЗаписатьИсторию($_м);

		}
	private function сПолучитьАвторизацию()
		{
		echo 'сПолучитьАвторизацию()'."\n";
		$сЗаписаннаяПозиция='';
		if(is_file($this->сРасполож.'/'.$this->сРоль.'/'.$this->сМойНомерок.'/0'.$this->сОконч))
			{
			//_Report('$this->сМойНомерок!=_'.$this->сМойНомерок);
			$сЗаписаннаяПозиция=file_get_contents($this->сРасполож.'/'.$this->сРоль.'/'.$this->сМойНомерок.'/0'.$this->сОконч);
			}
		if($сЗаписаннаяПозиция=='')
			{
			_Report(__CLASS__.' '.__FUNCTION__.' $сЗаписаннаяПозиция: '.$сЗаписаннаяПозиция);
			}
		return $сЗаписаннаяПозиция;
		}
	private function сНоваяАвторизация()
		{
		echo 'сНоваяАвторизация()'."\n";
		echo $this->сРасполож.'/'.$this->сРоль.'Total'.$this->сОконч."\n";
		$оВсего		=FileRead::objО2О($this->сРасполож.'/'.$this->сРоль.'Total'.$this->сОконч);

		if(isset($оВсего->int0Total))
			{
			echo $this->ч0ВсегоСлушателей	=($оВсего->int0Total);
			
			}
		$this->ч0ВсегоСлушателей++;
		$оO2oЗаписьИтого	=new O2oЗаписьИтого($this->сРоль, array(
							'int0Total'		=>$this->ч0ВсегоСлушателей,
							'int0'.$this->сРоль	=>$this->ч0ВсегоСлушателей
							)
						);
		exit;
		return $this->ч0ВсегоСлушателей;
		//return		сКодировать($this->ч0ВсегоСлушателей, 'к');
		//	$_SESSION['strListener']	= $this->сМойНомерок;
		}
	private function _ЗаписатьРоль()
		{
		if(!is_dir($this->сРасполож.'/'.$this->сРоль))
			{
			if(mkdir($this->сРасполож.'/'.$this->сРоль)===FALSE)
				{
				_Report('Не создать расположение: '.$this->сРасполож.'/'.$this->сРоль);
				}
			}
		}
	private function _ЗаписатьСлушателя()
		{
		if(is_dir($this->сРасполож.'/'.$this->сРоль.'/'.$this->сМойНомерок))
			{
			}
		else
			{
			if(mkdir($this->сРасполож.'/'.$this->сРоль.'/'.$this->сМойНомерок)===FALSE)
				{
				_Report('Cant create dir: '.$this->сРасполож.'/'.$this->сРоль.'/'.$this->сМойНомерок);
				}
			else
				{
				if(file_put_contents($this->сРасполож.'/'.$this->сРоль.'/'.$this->сТекущийСеанс, strMyJson($м)))
					{
					_Report('Не записать историю: '.$this->сРасполож.'/'.$this->сРоль.'/'.$this->сМойНомерок.$this->сОконч);
					}
				}
			}
		}
	private function _ЗаписатьИсторию($м)
		{

		}
	public static function с($_сРоль, $_м=array())
		{
		$obj	=new СоздатьСеанс($_сРоль, $_м);
		return $obj->сМойНомерок;
		}
	}
?>